# Задание: Потоки на классах в Python
#
# Цель задания:
# Освоить механизмы создания и потоков в Python.
# Практически применить знания, создав класс наследника от Thread и запустив его в потоке.
#
# Инструкции:
# Напишите программу с использованием механизмов многопоточности, которая создает два потока-рыцаря.
#
# Каждый рыцарь должен иметь имя (name) и умение(skill). Умение рыцаря определяет,
# сколько времени потребуется рыцарю, чтобы выполнить свою защитную миссию для королевства.
# Враги будут нападать в количестве 100 человек. Каждый день рыцарь может ослабить вражеское
# войско на skill-человек.
# Если у рыцаря skill равен 20, то защищать крепость он будет 5 дней (5 секунд в программе).
# Чем выше умение, тем быстрее рыцарь защитит королевство.
#
# Пример:
# knight1 = Knight("Sir Lancelot", 10) # Низкий уровень умения
# knight2 = Knight("Sir Galahad", 20) # Высокий уровень умения
# knight1.start()
# knight2.start()
# knight1.join()
# knight2.join()
#
# Результат консоли (из-за гонки потоков может отличаться порядок вывода из потоков):
# Sir Lancelot, на нас напали!
# Sir Galahad, на нас напали!
# Sir Lancelot, сражается 1 день(дня)..., осталось 90 воинов.
# Sir Galahad, сражается 1 день(дня)...., осталось 80 воинов.
# Sir Lancelot, сражается 2 день(дня)..., осталось 80 воинов.
# Sir Galahad, сражается 2 день(дня)...., осталось 60 воинов.
# Sir Lancelot, сражается 3 день(дня)..., осталось 70 воинов.
# Sir Galahad, сражается 3 день(дня)...., осталось 40 воинов.
# Sir Lancelot, сражается 4 день(дня)..., осталось 60 воинов.
# Sir Galahad, сражается 4 день(дня)...., осталось 20 воинов.
# Sir Lancelot, сражается 5 день(дня)..., осталось 50 воинов.
# Sir Galahad, сражается 5 день(дня)...., осталось 0 воинов.
# Sir Galahad одержал победу спустя 5 дней!
# Sir Lancelot, сражается 6 день(дня)..., осталось 40 воинов.
# Sir Lancelot, сражается 7 день(дня)..., осталось 30 воинов.
# Sir Lancelot, сражается 8 день(дня)..., осталось 20 воинов.
# Sir Lancelot, сражается 9 день(дня)..., осталось 10 воинов.
# Sir Lancelot, сражается 10 день(дня)..., осталось 0 воинов.
# Sir Lancelot одержал победу спустя 10 дней!
# Все битвы закончились!
#
# Примечание:
# В классе наследника (Knight), переопределите метод run, именно там будет
# заложена основная логика работы потоков.
# Используйте функцию sleep из модуля time для задержки времени.

from threading import Thread
import time


class Knight(Thread):

    def __init__(self, name, skill, *args, **kwargs):
        super(Knight, self).__init__(*args, **kwargs)
        self.name = name
        self.skill = skill
        self.enemy = 100
        self.time_dey = 5
        self.dey = 0

    def run(self):
        print(f"\033[33m{self.name} \033[31mНа нас напали !\033[0m")
        while self.enemy > 0:
            self.dey += 1
            print(f"\033[33m{self.name}, \033[31mсражается {self.dey} день(дня)...,"
                  f" \033[32mосталось {self.enemy - self.skill} воинов.\033[0m")
            self.enemy = self.enemy - self.skill
            time.sleep(self.time_dey)
        print(f"\033[33m{self.name} \033[31mодержал победу спустя {self.dey} дней!\033[0m")



knight1 = Knight("Sir Lancelot", 10)  # Низкий уровень умения
knight2 = Knight("Sir Galahad", 20)  # Высокий уровень умения
knight1.start()
knight2.start()
knight1.join()
knight2.join()
print("\033[36mВсе битвы закончились!\033[0m")