# Цель работы
#
# Освоить механизмы работы встроенных функций map и filter. Закрепить их различия и узнать,
# как передавать пользовательскую функцию, как аргумент в функции map и filter.
# Задание
#
# Дан список целых чисел, примените функции map и filter так, чтобы в конечном
# списке оставить нечётные квадраты чисел
#
# Примечание
# Не забывайте, что встроенные функции map и filter возвращают генератор,
# сами операции преобразования не выполняются.
#
# Входные данные
# [1, 2, 5, 7, 12, 11, 35, 4, 89, 10]

# Выходные данные
# [1, 25, 49, 121, 1225, 7921]

def get_filter_list(list_my: list) -> list:
    """Принимает одно уровневый список,
    и возвращает список нечётных квадратов чисел"""
    return list(map(lambda x: x*x, filter(lambda y: y % 2, list_my)))


print(get_filter_list([1, 2, 5, 7, 12, 11, 35, 4, 89, 10]))
